SetAS11702007
Syntax
SapObject.SapModel.Func.FuncRS.SetAS11702007
VB6 Procedure
Function SetAS11702007(ByVal Name As String, ByVal AS2007SiteClass As Long, ByVal AS2007kp As Double, ByVal AS2007Z As Double, ByVal AS2007Sp As Double, ByVal AS2007Mu As Double, ByVal DampRatio As Double) As Long
Parameters
Name
The name of an existing or new function. If this is an existing function then that function is modified, otherwise, a new function is added.
AS2007SiteClass
This is 1, 2, 3, 4 or 5, indicating the site class.
1 = A
2 = B
3 = C
4 = D
5 = E
AS2007kp
The probability factor, kp.
AS2007Z
The hazard factor, Z.
AS2007Sp
The structural performance factor, Sp.
AS2007Mu
The structural ductility factor, u.
DampRatio
The damping ratio for the function, 0 <= DampRatio < 1.
Remarks
This function defines an AS 1170.4 2007 response spectrum function.
The function returns zero if the function is successfully defined; otherwise it returns a nonzero value.
VBA Example
Sub SetRSFuncAS11702007()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'add AS 1170 2007 RS function
 ret = SapModel.Func.FuncRS.SetAS11702007("RS-1", 3, 1.3, 0.9, 0.77, 2, 0.04)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 14.00.
See Also
GetAS11702007